import type { Review } from "@/types";

export const reviews: Review[] = [
  {
    id: "1",
    name: "김▵▵",
    title: "현업 멘토",
    company: "코드잇 스프린트 : 프론트엔드 단기 심화 11기",
    content:
      "팀 프로젝트 중 가장 적극적으로 참여하며, 자발적으로 결과의 품질을 높일 수 있도록 리드합니다. 또한, API 인터페이스 설계 시 현업에서 사용하는 wrapper 구조를 도입하면서 탄탄한 실력을 확인할 수 있었습니다.",
    highlights: [
      "가장",
      "적극적",
      "자발적",
      "품질",
      "리드",
      "현업",
      "사용",
      "탄탄",
      "실력",
    ],
  },
  {
    id: "2",
    name: "김OO",
    title: "프론트엔드 개발자",
    company: "코드잇 스프린트 : 프론트엔드 단기 심화 11기",
    content:
      "코드 리뷰를 적극적으로 해주고, 프로젝트 전반의 다양한 부분을 자발적으로 챙겨주는 모습이 매우 고마웠습니다. 단순히 맡은 일만 하는 게 아니라 팀 전체의 코드 품질과 진행 상황을 계속 신경쓰며 리드해 주었던 점이 도움이 되었습니다.",
    highlights: ["코드 리뷰", "적극적", "자발적", "품질", "리드"],
  },
  {
    id: "3",
    name: "유XX",
    title: "프론트엔드 교육생",
    company: "코드잇 스프린트 : 프론트엔드 단기 심화 11기",
    content:
      "코드의 구조와 유지보수성을 꾸준히 고민하며, 팀 전체가 함께 관리하기 좋은 방향으로 개발하려는 노력이 인상적이었습니다. 확장성 있는 설계를 위해 세심하게 접근하는 모습에서 책임감과 성장 가능성을 느꼈습니다.",
    highlights: ["유지보수성", "확장성", "책임감", "성장", "가능성"],
  },
  {
    id: "4",
    name: "김▵▵",
    title: "현업 멘토",
    company: "코드잇 스프린트 : 프론트엔드 부트캠프 14기",
    content:
      "멘토링을 진행하면서 만난 분들 중에 가장 실력 있는 분이셨던 것 같아요. 코드에 대한 깊은 이해와 고민의 흔적, 그리고 리팩토링까지 어느 하나 허투루 하지 않으셔서, 오히려 제가 배운 부분도 정말 많았습니다.",
    highlights: ["가장", "실력", "있는", "깊은", "이해", "리팩토링"],
  },
  {
    id: "5",
    name: "홍OO",
    title: "프론트엔드 팀 리더",
    company: "코드잇 스프린트 : 프론트엔드 부트캠프 14기",
    content:
      "저희 팀 내에서 가장 실력이 좋으셔서 프로젝트 할 때 중심을 잘 잡아주신 것 같아 감사했습니다. 그리고 의견을 낼 때나 제안을 할 때 어떤식으로 진행해야할지 막막했는데 적극적으로 나서주셔서 감사했습니다.",
    highlights: ["중심", "제안", "적극적"],
  },
  {
    id: "6",
    name: "이XX",
    title: "프론트엔드 팀 리더",
    company: "코드잇 스프린트 : 프론트엔드 부트캠프 14기",
    content:
      "프로젝트에서 많은 부분을 맡아 주셨음에도 불구하고 깔끔한 코드 구조와 설계 등 배울 점이 정말 많았습니다! 덕분에 성공적으로 프로젝트를 마무리 할 수 있었습니다.",
    highlights: ["많은", "부분", "깔끔한", "성공적으로"],
  },
];
